{
  "english": {
    "webcam-head": "Allow access to the webcam?",
    "webcam-desc": "A webcam is required to fully experience the app. It will not work without the access. The video is not sent to a remote server, every computation is done within your web browser. Grant access to the webcam and enjoy the game with full privacy! Allow the webcam in your web browser's settings.",
    "agree": "OK",
    "reject": "Reject",
    "show-video": "Show video",
    "enable-emotion": "Enable dynamic difficulty",
    "play": "Play",
    "winner": "Winner",
    "about": "About",
    "about-text": "The app uses artificial intelligence to recognize player's emotions based on their facial expression. The result is then used to tune the difficulty of the game according to the identified emotion. \n\nYou can turn on and off dynamic difficulty at any point in the menu at the top of the website.  This way you can still challenge yourself! Moreover, the menu allows you to turn off the video preview.\n\nWatch the ball change colors to mirror your emotions! Pink is for happiness, yellow for fear, blue for being sad, red for being angry, and white is for being neutral.\n\nThe image is obtained through a webcam. The video is not sent to a remote server, every computation is done within your web browser. Enjoy the game with full privacy!",
    "survey": "Go to Survey"
  },
  "polish": {
    "webcam-head": "Zezwolić na dostęp do kamery?",
    "webcam-desc": "Aplikacja wymaga użycia kamery do poprawnego działania. Obraz nie jest wysyłany na serwer zewnętrzny, wszystkie wymagane działania realizowane są w przeglądarce internetowej. Zewzól na dostęp do kamery i graj z zachowaniem całkowitej prywatności! Zmień dostęp w ustawieniach przeglądarki.",
    "agree": "Akceptuj",
    "reject": "Odrzuć",
    "show-video": "Pokaż podgląd",
    "enable-emotion": "Włącz dynamiczny poziom trudności",
    "play": "Zagraj",
    "winner": "Zwycięzca",
    "about": "O aplikacji",
    "about-text": "Aplikacja używa sztucznej inteligencji do rozpoznawania emocji gracza na podstawie mimiki twarzy. Rezultat jest wykorzystywany do dostosowania poziomu trudności gry zgodnie z zidentyfikowaną emocją.\n\nMożesz włączać i wyłączać dynamiczny poziom gry w każdej chwili rozgrywki za pomocą opcji dostępnej w menu na górze strony. W ten sposób nadal możesz stawiać sobie wyzwania! W menu dostępna jest również opcja wyłączenia podglądu wideo.\n\nPatrz jak kolor piłeczki zmienia się wraz z twoimi emocjami! Jest różowa, gdy jesteś szczęśliwy, żółta, gdy odczuwasz strach, niebieska, gdy jesteś smutny, czerwona, gdy się zdenerwujesz oraz biała, gdy zachowujesz neutralność.\n\nObraz nie jest wysyłany na serwer zewnętrzny, wszystkie wymagane działania realizowane są w przeglądarce internetowej. Graj z zachowaniem całkowitej prywatności!",
    "survey": "Przejdź do ankiety"
  }
}